MESSAGES = {
    1: {
        "id": "1",
        "type": "",
        "text": [
            "Привет! \"Я всё сам\", бот для самозанятых! Знаю все о самозанятых и подбираю документы для самостоятельного ведения дела. Ты самозанятый или хочешь стать им? Тогда я тебе помогу!"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Начать"
            }
        ]
    }, 2: {
        "id": "2",
        "type": "",
        "text": [
            "Зарегистрированы ли вы в качестве самозанятого?"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 3: {
        "id": "3",
        "type": "",
        "text": [
            "Выберите следующее действие:"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Ответы на вопросы о самозанятых"
            }, {
                "name": 2,
                "text": "Проекты документов"
            }
        ]
    }, 4: {
        "id": "4",
        "type": "",
        "text": [
            "Вы хотели бы продавать товары собственного производства или оказывать услуги?",
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Товары"
            }, {
                "name": 2,
                "text": "Услуги"
            }
        ]
    }, 5: {
        "id": "5",
        "type": "",
        "text": [
            "В какой отрасли вы хотели бы продавать товары?",
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Торты и пирожные"
            }, {
                "name": 2,
                "text": "Декоративные изделия ручной работы"
            }, {
                "name": 3,
                "text": "Флористические композиции и букеты из цветов"
            }
        ]
    }, 6: {
        "id": "6",
        "type": "",
        "text": [
            "В какой отрасли вы хотели бы оказывать услуги?",
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Диджитал-услуги (копирайтинг, создание сайтов, реклама и др.)"
            }, {
                "name": 2,
                "text": "Услуги перевозок"
            }, {
                "name": 3,
                "text": "Услуги в сфере недвижимости (ремонт, уборка, сдача в аренду)"
            }, {
                "name": 4,
                "text": "Услуги по репетиторству"
            }
        ]
    }, 7: {## 4
        "id": "7",
        "type": "",
        "text": [
            "Выберите вид деятельности, которым хотите заниматься:",
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Найм помещений"
            }, {
                "name": 2,
                "text": "Уборка помещений"
            }, {
                "name": 3,
                "text": "Ремонт помещений"
            }, {
                "name": 4,
                "text": "Уборка офисов"
            }, {
                "name": 5,
                "text": "Ремонт коммерческой недвижимости"
            }, {
                "name": 6,
                "text": "Другое"
            }
        ]
    }, 8: {## 5
        "id": "8",
        "type": "",
        "text": [
            "Введите ваш вопрос:",
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 11: {
        "id": "11",
        "type": "",
        "text": [
            "Сдача в найм жилых помещений",
        ],
        "is_buttons": False,
        "buttons": [

        ]
    }, 12: {
        "id": "12",
        "type": "",
        "text": [
            "~iВнимание! Перед использованием Договора найма жилого помещения самозанятого ознакомьтесь с материалами ниже:",
            "~n",
            "~adУборка/Обязательно к ознакомлению.docx",
            "~n",
            "~n",
            "Договор найма жилого помещения самозанятого",
            "~n",
            "~adНайм/Договор найма жилого помещения самозанятого.docx",
            "~n",
            "Акт приёма-передачи к Договору найма жилого помещения",
            "~n",
            "~adНайм/Акт приёма-передачи к Договору найма жилого помещения.docx",
            "~n",
            "Акт возврата к Договору найма жилого помещения",
            "~n",
            "~adНайм/Акт возврата к Договору найма жилого помещения.docx"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 16: {
        "id": "16",
        "type": "",
        "text": [
            "Уборка жилых помещений"
        ],
        "is_buttons": True,
        "buttons": [

        ]
    }, 17: {
        "id": "17",
        "type": "",
        "text": [
            "~iВнимание! Перед использованием Договора оказания услуг по уборке помещения ознакомьтесь с материалами ниже:",
            "~n",
            "~adУборка/Обязательно к ознакомлению.docx",
            "~n",
            "~n",
            "Договор возмездного оказания услуг по уборке (на постоянной основе)",
            "~n",
            "~adУборка/Договор возмездного оказания услуг по уборке_на постоянной основе.docx",
            "~n",
            "Договор возмездного оказания услуг по уборке помещения_не на постоянной основе",
            "~n",
            "~adУборка/Договор возмездного оказания услуг по уборке помещения_не на постоянной основе.docx",
            "~n",
            "График уборки",
            "~n",
            "~adУборка/График уборки.docx",
            "~n",
            "Акт сдачи-приемки услуг",
            "~n",
            "~adУборка/Акт сдачи-приемки услуг.docx",
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 21: {
        "id": "21",
        "type": "",
        "text": [
            "Ремонт жилых помещений"
        ],
        "is_buttons": True,
        "buttons": [

        ]
    }, 22: {
        "id": "22",
        "type": "",
        "text": [
            "~iВнимание! Перед использованием Договора подряда на выполнение ремонтных работ ознакомьтесь с материалами ниже:",
            "~n",
            "~adРемонт/Обязательно к ознакомлению.docx",
            "~n",
            "~n",
            "Договор подряда на выполнение ремонтных работ",
            "~n",
            "~adРемонт/Договор подряда на выполнение ремонтных работ.docx",
            "~n",
            "Акт сдачи-приемки",
            "~n",
            "~adРемонт/Акт сдачи-приемки.docx"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 26: {
        "id": "26",
        "type": "",
        "text": [
            "К сожалению, у нас ещё нет документов для этого вида деятельности. Добавление планируется в ___"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 30: {
        "id": "30",
        "type": "",
        "text": [
            "Пройти тест 'Могу ли я стать самозанятым?'"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 31: {
        "id": "31",
        "type": "question_test",
        "text": [
            "Сколько вам лет?"
        ],
        "is_buttons": False,
        "buttons": [
            {
                "name": 1,
                "text": "Мне 18 лет и больше"
            }, {
                "name": 2,
                "text": "Мне от 14 до 18 лет"
            }, {
                "name": 3,
                "text": "Мне меньше 14 лет"
            }
        ]
    }, 32: {
        "id": "32",
        "type": "comment",
        "text": [
            "~iВы можете осуществлять деятельность в качестве самозанятого"
        ],
        "is_buttons": False,
        "buttons": [

        ]
    }, 33: {
        "id": "33",
        "type": "comment",
        "text": [
            "~iВы можете осуществлять деятельность в качестве самозанятого, если вы — дееспособный гражданин (например, после вступления в брак или эмансипации) или у вас есть письменное согласие родителей на осуществление деятельности"
        ],
        "is_buttons": False,
        "buttons": [

        ]
    }, 3431: {
        "id": "3431",
        "type": "comment",
        "text": [
            "Вы не можете осуществлять деятельность в качестве самозанятого"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 3435: {
        "id": "3435",
        "type": "comment",
        "text": [
            "Вы не можете осуществлять деятельность в качестве самозанятого"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 35: {
        "id": "35",
        "type": "question_test",
        "text": [
            "Гражданином какой страны вы являетесь?"
        ],
        "is_buttons": False,
        "buttons": [
            {
                "name": 1,
                "text": "Гражданин РФ"
            }, {
                "name": 2,
                "text": "Гражданин Армении, Беларуси, Казахстана, Кыргызстана"
            }, {
                "name": 3,
                "text": "Гражданин Украины, ДНР или ЛНР"
            }, {
                "name": 4,
                "text": "Гражданин иной страны/лицо без гражданства"
            }
        ]
    }, 36: {
        "id": "36",
        "type": "question_test",
        "text": [
            "На какой территории вы планируете осуществлять деятельность?"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "На территории Российской Федерации"
            }, {
                "name": 2,
                "text": "Заграницей"
            }
        ]
    }, 37: {
        "id": "37",
        "type": "comment",
        "text": [
            "~iОбратите внимание, что в качестве самозанятого вы можете осуществлять деятельность только в пределах одного субъекта России"
        ],
        "is_buttons": False,
        "buttons": [

        ]
    }, 38: {
        "id": "38",
        "type": "comment",
        "text": [
            "~iВы можете осуществлять деятельность в качестве самозанятого только в пределах России"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 39: {
        "id": "39",
        "type": "question_test",
        "text": [
            "Планируете ли вы осуществлять деятельность, приносящую доход?"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 40: {
        "id": "40",
        "type": "comment",
        "text": [
            "~iЧтобы быть самозанятым, важно получать доход. Если вы не получаете доход от продажи товаров, выполнения работ, оказания услуг или реализации имущественных прав, вы не можете стать самозанятым"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 41: {
        "id": "41",
        "type": "question_test",
        "text": [
            "Планируете ли вы быть работником или работодателем по трудовому договору?"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }, {
                "name": 3,
                "text": "На сегодняшний день работаю"
            }
        ]
    }, 42: {
        "id": "42",
        "type": "comment",
        "text": [
            "~iПримечание! Вы можете работать по трудовому договору только в тех организациях, что не будут являться вашими заказчиками при осуществлении деятельности в качестве самозанятого"
        ],
        "is_buttons": True,
        "buttons": [

        ]
    }, 43: {
        "id": "43",
        "type": "comment",
        "text": [
            "~iПримечание! Вы не можете при осуществлении деятельности в качестве самозанятого заключать договор с организацией, являющейся вашим работодателем по трудовому договору"
        ],
        "is_buttons": False,
        "buttons": [

        ]
    }, 44: {
        "id": "44",
        "type": "question_test",
        "text": [
            "Планируете ли вы получать доход от деятельности самозанятого более 200 т./руб. в месяц?",
            "~n",
            "~iПримечание! В данном случае в понятие «доход» включаются все поступления денежных средств от услуг, которые вы предоставляете клиентам, а также за проданные вами товары."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 45: {
        "id": "45",
        "type": "comment",
        "text": [
            "~iВаш доход от деятельности самозанятого не может превышать более 2.4 млн. рублей в текущем календарном году"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 46: {
        "id": "46",
        "type": "question_test",
        "text": [
            "Планируете ли вы заниматься указанными видами деятельности:",
            "~n",
            "1) реализация подакцизных товаров и товаров, подлежащих обязательной маркировке (например, табачные изделия, обувь и другие);",
            "~n",
            "2) перепродажа товаров и имущественных прав;",
            "~n",
            "3) доставка товаров в интересах других лиц (кроме случаев, когда оплата производится через кассу продавца;",
            "~n",
            "4) предпринимательская деятельность в интересах другого лица;",
            "~n",
            "5) добыча или сбыт полезных ископаемых"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 47: {
        "id": "47",
        "type": "comment",
        "text": [
            "Лица, занимающиеся данным видом деятельности, не вправе переходить на специальный налоговый режим «Налог на профессиональный доход» и считаться самозанятыми"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 48: {
        "id": "48",
        "type": "result_test",
        "text": [
            "~bВы соответствуете всем критериям и вправе осуществлять деятельность в качестве самозанятого"
        ],
        "is_buttons": False,
        "buttons": [

        ]
    }, 61: {
        "id": "61",
        "type": "",
        "text": [
            "Выберите следующее действие:"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Документы"
            }, {
                "name": 2,
                "text": "Перейти к регистрации"
            }, {
                "name": 3,
                "text": "Вопрос-ответ"
            }
        ]
    }, 62: {
        "id": "62",
        "type": "",
        "text": [
            "Регистрация через ФНС",
            "~n",
            "~auhttps://www.nalog.gov.ru/~tПерейти на сайт ФНС"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Документы"
            }, {
                "name": 2,
                "text": "Вопрос-ответ"
            }, {
                "name": 3,
                "text": "В начало"
            }
        ]
    }, 100: {
        "id": "100",
        "type": "",
        "text": [
            "Извините, я не понимаю ваш ответ. Можете повторить?"
        ],
        "is_buttons": False,
        "buttons": [

        ]
    }, 101: {
        "id": "101",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Кто вправе стать «самозанятым» и применять налог на профессиональный доход?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/~tЗаконом",
            " применять специальный налоговый режим «Налог на профессиональный доход» могут физические лица (граждане России и других государств ЕАЭС), а также индивидуальные предприниматели, не имеющие наемных работников по трудовому договору. Они могут осуществлять реализацию собственных товаров (работ, услуг, имущественных прав), местом ведения деятельности является территория любого из субъектов Российской Федерации."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 102: {
        "id": "102",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Каким образом выдавать платежные документы (чек)? Как рассчитываться с клиентом?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/ad291257df0088ddbc91dc935ca07c7d40bde627/~tЗаконом",
            " при расчетах самозанятого налогоплательщика с покупателем (клиентом) с использованием мобильного приложения «Мой налог»/ веб кабинета «Мой налог», необходимо сформировать и выдать чек. Это делается через добавление новой продажи. При этом понадобится указать наименование товара, работы или услуги и ввести ее стоимость.",
            "~n",
            "~n",
            "Чек необходимо передать клиенту одним из следующих способов:",
            "~n",
            "· отправить на мобильный телефон или электронную почту;",
            "~n",
            "· распечатать и передать лично;",
            "~n",
            "· предоставить для считывания по QR-коду чека с мобильного телефона налогоплательщика налога на профессиональный доход с помощью телефона клиента.",
            "~n",
            "По общему правилу отражать получаемые доходы необходимо сразу в момент расчета."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 103: {
        "id": "103",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Как платить налог на профессиональный доход?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/ad291257df0088ddbc91dc935ca07c7d40bde627/~tп.2 ст. 14 ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»",
            " квитанция на уплату налога автоматически формируется налоговым органом и направляется в приложение «Мой налог». Для простоты оплаты квитанция содержит специализированный QR-код.",
            "~n",
            "~n",
            "Получив квитанцию, Вы можете оплатить налог любым из следующих способов:",
            "~n",
            "· непосредственно через мобильное приложение «Мой налог»/веб-кабинет «Мой налог» с использованием банковской карты;",
            "~n",
            "· в мобильном приложении Вашего банка или на сайте любого платежного сервиса по платежным реквизитам из квитанции или отсканировав QR-код из нее;",
            "~n",
            "· через портал государственных услуг Российской Федерации;",
            "~n",
            "· лично обратиться с квитанцией в любой банк, банкомат или платежный терминал;",
            "~n",
            "· передать поручение банку или оператору электронных площадок на уплату налога от Вашего имени в случае, если Вы формируете чеки через приложение соответствующего банка или оператора электронных площадок."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 104: {
        "id": "104",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Какие налоговые ставки предусмотрены по налогу на профессиональный доход?",
            "~n",
            "Ответ: ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/e08381c7bc85397c1661bdeaa62be996df822d6e/~tЗаконом",
            " установлены следующие ставки:",
            "~n",
            "· 4% используется при расчетах с физическими лицами;",
            "~n",
            "· 6% используется при расчетах с организациями и индивидуальными предпринимателями."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 105: {
        "id": "105",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Какой срок уплаты налога на профессиональный доход?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/3918929b90f7cc21052860816dcdc15636aa3373/~tЗаконом",
            " уплата налога на профессиональный доход производится ежемесячно не позднее 25 числа месяца, следующего за истекшим налоговым периодом (месяцем). Если эта дата является праздничным или выходным днем, тогда срок уплаты переносится на первый рабочий день.",
            "~n",
            "Следует учесть, что первый налоговый период считают со дня регистрации и до конца следующего месяца. Например, при постановке на учет в январе уведомление о начисленном налоге впервые придет до 12 марта. Заплатить указанную в нем сумму нужно до 25 марта."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 106: {
        "id": "106",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Кто не вправе применять специальный налоговый режим «Налог на профессиональный доход»?",
            "~n",
            "Ответ: Не вправе применять специальный налоговый режим  в соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/30ba0412dfedfe46e8061ea063246bac59da2b69/~tЗаконом",
            ":",
            "~n",
            "· Лица, осуществляющие реализацию подакцизных товаров и товаров, подлежащих обязательной маркировке средствами идентификации в соответствии с законодательством Российской Федерации;",
            "~n",
            "· Лица, осуществляющие перепродажу товаров, имущественных прав, за исключением продажи имущества, использовавшегося ими для личных, домашних и (или) иных подобных нужд;",
            "~n",
            "· Лица, занимающиеся добычей и (или) реализацией полезных ископаемых;",
            "~n",
            "· Лица, имеющие работников, с которыми они состоят в трудовых отношениях;",
            "~n",
            "· Лица, ведущие предпринимательскую деятельность в интересах другого лица на основе договоров поручения, договоров комиссии либо агентских договоров, за исключением случаев ведения такой деятельности при условии применения налогоплательщиком-продавцом контрольно-кассовой техники при расчетах с заказчиками за указанные услуги в соответствии с действующим законодательством РФ о применении контрольно-кассовой техники;",
            "~n",
            "· Лица, оказывающие услуги по доставке товаров с приемом (передачей) платежей за указанные товары в интересах других лиц, за исключением оказания таких услуг при условии применения налогоплательщиком зарегистрированной продавцом товаров контрольно-кассовой техники при расчетах с покупателями (заказчиками) за указанные товары в соответствии с действующим законодательством о применении контрольно-кассовой техники;",
            "~n",
            "· Лица, применяющие иные специальные налоговые режимы или ведущие предпринимательскую деятельность, доходы от которой облагаются налогом на доходы физических лиц, за исключением случаев, предусмотренных частью 4 статьи 15 Федерального закона от 27.11.2018 №422-ФЗ;",
            "~n",
            "· Налогоплательщики, у которых доходы, учитываемые при определении налоговой базы, превысили в текущем календарном году 2,4 миллиона рублей."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 107: {
        "id": "107",
        "type": "",
        "text": [
            "Найден похожий вопрос:"
            "~n",
            "Каким образом самозанятый налогоплательщик будет проинформирован о необходимости уплаты налога?"
            "~n",
            "Ответ:"
            "~n",
            "1. В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/3918929b90f7cc21052860816dcdc15636aa3373/~tЗаконом",
            " в период с 9-го по 12-е число месяца, следующего за истекшим налоговым периодом, налоговым органом автоматически формируется квитанция на уплату налога и направляется Вам в мобильное приложение «Мой налог» и в веб-кабинет «Мой налог». Если сумма исчисленного налога не превышает 100 рублей, этот налог будет включен в следующий налоговый период, пока размер налога не составит более 100 рублей."
            "~n",
            "2. Налогоплательщик вправе уполномочить на уплату налога операторов электронных площадок и (или) кредитные организации, которые осуществляют информационный обмен с налоговыми органами. В этом случае налоговый орган будет дополнительно направлять уведомление об уплате налога уполномоченному лицу. "
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 108: {
        "id": "108",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Кто такие «самозанятые» налогоплательщики налога на профессиональный доход?",
            "~n",
            "Ответ:",
            "~n",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/3918929b90f7cc21052860816dcdc15636aa3373/~tЗаконом",
            " данный термин не определен. В широком смысле – это форма занятости, при которой гражданин получает доход от его профессиональной деятельности, например, оказание услуг или работ, реализация произведенных им товаров, при осуществлении которых он не имеет работодателя и наемных работников."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 109: {
        "id": "109",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Каким образом плательщик налога на профессиональный доход может получить справку о постановке на учет?",
            "~n",
            "В мобильном приложении «Мой налог» и веб-кабинете, расположенном на сайте ФНС России ",
            "~auhttps://npd.nalog.ru/~thttps://npd.nalog.ru/",
            " «самозанятый» налогоплательщик может самостоятельно сформировать справку о постановке на учет (снятии с учета) в налоговом органе физического лица в качестве налогоплательщика. Указанная справка подписывается электронной подписью налогового органа, сформированной в соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_112701/~tФЗ «Об электронной подписи»",
            "."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 110: {
        "id": "110",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Каков порядок снятия с налогового учета плательщика НПД в добровольном порядке?",
            "~n",
            "Ответ:",
            "~n",
            "Снятие с налогового учета плательщика НПД в добровольном порядке в соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/fb070707616493227c21dea15dba52b2fcab4465/~tЗаконом",
            " осуществляется при представлении в налоговый орган через мобильное приложение «Мой налог»/веб-кабинет «Мой налог» заявления о снятии с учета в случае отказа от применения специального налогового режима.",
            "~n",
            "Процедура снятия с учета проходит без посещения налогового органа через мобильное приложение «Мой налог»/веб-кабинет. Для этого в мобильном приложении «Мой налог» необходимо в разделе «Прочее»-«Профиль» внизу нажать кнопку «Сняться с учета НПД», выбрать причину снятия с данного режима налогообложения и подтвердить свое решение.",
            "~n",
            "Датой снятия с учета в качестве плательщика НПД является дата направления в налоговый орган заявления о снятии с учета.",
            "~n",
            "При постановке на учет в качестве плательщика НПД через уполномоченную кредитную организацию о решении сняться с учета в качестве плательщика НПД необходимо уведомить уполномоченную кредитную организацию.",
            "~n",
            "Налогоплательщик после снятия с учета в налоговом органе в качестве налогоплательщика вправе повторно встать на учет в качестве плательщика НПД при отсутствии у него недоимки по налогу, задолженности по пеням и штрафам по налогу.",
            "~n",
            "После снятия с учета (утраты права) предоставляется ограниченный доступ в мобильное приложение «Мой налог»/веб-кабинет «Мой налог», в котором будет сохранена функция уплаты налога."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 111: {
        "id": "111",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Будут ли брать налог с самозанятого в момент перевода денежных средств, полученных от покупателя (клиента), за товар (работу, услугу)?",
            "~n",
            "Ответ: Нет, в соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/c2d36c561e1cb3865295658c7014e0a0d10371cc/~tЗаконом",
            " сумма налога, рассчитывается налоговым органом, исходя из суммы дохода налогоплательщика налога на профессиональный доход, который такой налогоплательщик обязан отразить в мобильном приложении «Мой налог» \\ вэб-кабинете «Мой налог»."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 112: {
        "id": "112",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В какие сроки самозанятому необходимо производить платежи по страховым взносам?",
            "~n",
            "Ответ: Рассчитанные суммы добровольных платежей надо уплатить не позднее 31 декабря текущего календарного года в соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_34447/17b69f0a1bd6e0e7191cec91abee452fb7f139ee/~tФЗ «Об обязательном пенсионном страховании в Российской Федерации»",
            "."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 113: {
        "id": "113",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В какой срок налоговый орган производит перерасчет налога после аннулирования чека и направляет новую квитанцию на уплату налога?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/3918929b90f7cc21052860816dcdc15636aa3373/~tЗаконом",
            " налоговый орган производит расчёт налога ежемесячно не позднее 12-го числа месяца, следующего за истекшим налоговым периодом. Каждый расчет налога учитывает аннулированные чеки. При этом отдельное уведомление не формируется.",
            "~n",
            "Налоговый орган уведомит самозанятого налогоплательщика через мобильное приложение «Мой налог» и веб-кабинет «Мой налог» о сумме налога, подлежащей уплате, с указанием реквизитов. Соответственно, в указанной сумме уже будут учтены Ваши корректировки дохода."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 114: {
        "id": "114",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В какой срок необходимо сформировать чек на полученную сумму профессионального дохода? Какой период можно будет выбрать в приложении «Мой налог», если сразу не сформировал чек? Если чек был сформирован не в момент расчета с покупателем, предусмотрен ли какой-либо штраф?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/ad291257df0088ddbc91dc935ca07c7d40bde627/~tЗаконом",
            " чек должен быть сформирован самозанятым и передан покупателю (заказчику) в момент расчета наличными денежными средствами и (или) с использованием электронных средств платежа. При иных формах денежных расчетов в безналичном порядке чек должен быть сформирован и передан покупателю (заказчику) не позднее 9-го числа месяца, следующего за налоговым периодом, в котором произведены расчеты. В мобильном приложении «Мой налог» самозанятый при формировании чека может указать дату осуществления расчета, даже если такая дата уже прошла, данный расчет будет включен в сумму налога в следующем налоговом периоде.",
            "~n",
            "В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_19671/96c8b6937f62c6afc0bd07ef05603adf56952f35/#:~:text=%D0%A0%D0%A4%20%D0%A1%D1%82%D0%B0%D1%82%D1%8C%D1%8F%20129.13.-,%D0%9D%D0%B0%D1%80%D1%83%D1%88%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%BF%D0%BE%D1%80%D1%8F%D0%B4%D0%BA%D0%B0%20%D0%B8%20(%D0%B8%D0%BB%D0%B8)%20%D1%81%D1%80%D0%BE%D0%BA%D0%BE%D0%B2%20%D0%BF%D0%B~tНалоговым кодексом РФ",
            " нарушение налогоплательщиком порядка и (или) сроков передачи в налоговый орган сведений о произведенном расчете, связанном с получением дохода от реализации товаров (работ, услуг, имущественных прав), влечет взыскание штрафа в размере 20 процентов от суммы такого расчета. Те же деяния, совершенные повторно в течение шести месяцев, влекут взыскание штрафа в размере суммы такого расчета."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 115: {
        "id": "115",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В какой срок отображается информация об уплате налога в мобильном приложении «Мой налог»?",
            "~n",
            "Ответ:",
            "~n",
            "Информация об уплате налога отображается как правило в течение 10 рабочих дней при оплате банковской картой и в течение 20 календарных дней при оплате по квитанции через кредитную организацию"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 116: {
        "id": "116",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В какой срок самозанятый налогоплательщик должен передать чек заказчику?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/ad291257df0088ddbc91dc935ca07c7d40bde627/~tЗаконом",
            " в общем случае отражать получаемые доходы и передавать чеки необходимо сразу в момент расчета. При других формах расчета чек формируется и передается не позднее 9-го числа месяца, следующего за тем, в котором произведена оплата. Если «самозанятый» налогоплательщик работает через посредника по договору комиссии, поручения или агентскому договору, и кто-то продает товары услуги в его интересах, в этом случае чек формирует не налогоплательщик налога на профессиональный доход, а посредник. При условии, что по закону у посредника есть обязанность применять контрольно-кассовую технику.",
            "~n",
            "ИСТОЧНИК:",
            "~n",
            "Часть 3 статьи 14 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 117: {
        "id": "117",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В каком порядке осуществляется зачет и возврат сумм излишне уплаченного налога на профессиональный доход?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/c2d36c561e1cb3865295658c7014e0a0d10371cc/~tЗаконом",
            " сумма излишне уплаченного налога подлежит зачету в счет предстоящих платежей налогоплательщика, погашения недоимки, задолженности по пеням и штрафам за налоговые правонарушения только по этому налогу. Возврат сумм излишне уплаченного налога на профессиональный доход осуществляется в порядке, предусмотренном статьей 78 Налогового кодекса Российской Федерации.",
            "~n",
            "Заявление на возврат/зачет излишне уплаченного налога может быть подано в ИФНС следующим способом:",
            "~n",
            "- лично налогоплательщиком;",
            "~n",
            "- его представителем по нотариальной доверенности;",
            "~n",
            "- почтой (с уведомлением о вручении, описью вложения); - в электронной форме с использованием интернет-сервиса «Личный кабинет налогоплательщика для физических лиц», подписанное усиленной квалифицированной или неквалифицированной электронной подписью налогоплательщика."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 118: {
        "id": "118",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В каком порядке представляется налоговый вычет (бонус) для самозанятых налогоплательщиков?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/13e4df89facf9d8907f4128f64e63a516a966c9f/~tЗаконом",
            " бонус в размере 10 000 рублей предоставляется государством единожды и расходуется постепенно. С помощью бонуса налоговая ставка по доходу, полученному самозанятым налогоплательщиком от физических лиц, будет автоматически уменьшена с 4% до 3%, по доходу, полученному от юридических лиц – с 6% до 4%. Например доход за месяц составил 10000 рублей, и весь доход самозанятый получили от физических лиц, следовательно, будет начислен налог в размере 400 рублей. Но с помощью бонуса нужно будет заплатить только 300 рублей, так как 100 рублей автоматически будет списано из бонуса. При этом остаток бонуса будет уменьшен с 10000 рублей до 9900 рублей. После того как бонус будет полностью потрачен, налоговые ставки будут 4% и 6% соответственно. Потратить бонус можно только для уплаты налога. Повторно бонус не предоставляется. Остаток бонуса уменьшается автоматически, и самозанятый налогоплательщик всегда может его увидеть на главной странице или в настройках профиля в приложении «Мой налог»."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 119: {
        "id": "119",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В каком размере плательщикам НПД необходимо уплачивать страховые взносы? Какой максимальный размер добровольных страховых взносов?",
            "~n",
            "Ответ:",
            "~n",
            "Физические лица, применяющие специальный налоговый режим «Налог на профессиональный доход», постоянно или временно проживающие на территории Российской Федерации, вправе добровольно вступить в правоотношения по обязательному пенсионному страхованию.",
            "~n",
            "Плательщик самостоятельно определяет размер страховых взносов для уплаты, но в пределах максимального размера, определенного законодательством. Максимальный размер страховых взносов составляет:",
            "~n",
            "- 270 167,04 рублей за период с 01.01.2021 по 31.12.2021;",
            "~n",
            "- 293 356,80 рублей за период с 01.01.2022 по 31.12.2022.",
            "~n",
            "ИСТОЧНИК:",
            "~n",
            "Пункт 6 статьи 29 Федерального закона от 15.12.2001 № 167-ФЗ «Об обязательном пенсионном страховании в Российской Федерации»;",
            "~n",
            "Подпункт 1 пункта 2 статьи 425 Налогового кодекса Российской Федерации"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 120: {
        "id": "120",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "В приложении «Мой налог» наименование услуг, работы или товара при вводе оплаты необходимо заводить каждый раз вручную?",
            "~n",
            "Ответ: Нет, сведения об оказанной услуге, выполненной работе или реализованном товаре будут сохранены в истории операций, в связи с чем, при необходимости, «самозанятый» налогоплательщик сможет повторить платеж, не изменяя наименование услуги или товара, изменив только сумму. Для создания копии чека необходимо открыть чек, копию которого необходимо сделать, и нажать кнопку «Повторить»."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 121: {
        "id": "121",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Вправе ли плательщик НПД сдавать в аренду транспортное средство и другие виды движимого имущества?",
            "~n",
            "Ответ: ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/30ba0412dfedfe46e8061ea063246bac59da2b69/~tЗакон",
            " не содержит ограничений относительно сдачи в аренду движимого имущества, включая транспортные средства и специальную технику."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 122: {
        "id": "122",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Если инвалид 2-ой группы оформится в качестве самозанятого налогоплательщика, сохранится ли его статус инвалида? И вытекающие из неё возможности получать лекарства, проходить реабилитацию и т.п.?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/30ba0412dfedfe46e8061ea063246bac59da2b69/~tЗаконом",
            " налогоплательщиками налога на профессиональный доход могут быть физические лица и индивидуальные предприниматели, не имеющие наемных работников по трудовому договору, осуществляющие реализацию товаров (работ, услуг, имущественных прав) на территории Российской Федерации. Физические лица, применяющие специальный налоговый режим, освобождаются от налогообложения налогом на доходы физических лиц в отношении доходов, являющихся объектом налогообложения налогом на профессиональный доход. Данный налоговый режим не может повлиять на статус инвалида и на компенсации, связанные с этим статусом.",
            "~n",
            "ИСТОЧНИК:",
            "~n",
            "Федеральный закон от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 123: {
        "id": "123",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Если ИП встает на учет как самозанятый налогоплательщик, как рассчитываются и уплачиваются страховые взносы?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/b95cb9fec1c635e413e8e40c9bb7e951acd3bf97/~tЗаконом",
            " индивидуальные предприниматели, указанные в подпункте 2 пункта 1 статьи 419 Налогового кодекса Российской Федерации, не признаются плательщиками страховых взносов за период применения специального налогового режима «Налог на профессиональный доход»."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 124: {
        "id": "124",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Если пенсионер зарегистрируется в качестве налогоплательщика налога на профессиональный доход, то будет ли он получать компенсации?",
            "~n",
            "Ответ: В соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_311977/27164c06aa904117df15dede95fb55764e9054e7/~tЗаконом",
            " доходы, получаемые налогоплательщиками, зарегистрированными в качестве налогоплательщиков налога на профессиональных доход, не подлежат обязательному пенсионному страхованию, в связи с чем трудовой стаж у таких налогоплательщиков в период уплаты налога на профессиональный доход, не идет. Также и пенсионер, зарегистрированный в качестве налогоплательщика налога на профессиональный доход, считается трудоустроенным только в период, когда их доходы подлежат обязательному пенсионному страхованию в соответствии с ",
            "~auhttp://www.consultant.ru/document/cons_doc_LAW_34447/17b69f0a1bd6e0e7191cec91abee452fb7f139ee/~tФЗ «Об обязательном пенсионном страховании в Российской Федерации»",
            ". В связи с этим, статус налогоплательщика налога на профессиональный доход не влияет на получение льгот и компенсаций."
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 125: {
        "id": "125",
        "type": "",
        "text": [
            "Найден похожий вопрос:",
            "~n",
            "Если самозанятый налогоплательщик вернул деньги и аннулировал чек, какие действия должен произвести заказчик?",
            "~n",
            "Ответ:",
            "~n",
            "При возврате суммы оплаты заказчику можно аннулировать чек. При аннулировании чека из-за неточных данных сумма дохода налогоплательщика налога на профессиональный доход тоже корректируется. При этом налогоплательщику налога на профессиональный доход может потребоваться указать причину аннулирования. Если чек аннулирован, заказчик также вносит изменения в суммы расходов, учитываемых при расчете налоговой базы. Порядок корректировки зависит от применяемого заказчиком режима налогообложения.",
            "~n",
            "ИСТОЧНИК:",
            "~n",
            "Части 3, 4 ст. 8 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }, {
                "name": 2,
                "text": "Ответ не найден"   
            }
        ]
    }, 126: {
        "id": "126",
        "type": "",
        "text": [
            "Извините, я не понимаю ваш вопрос. Можете повторить вопрос, или посмотреть наш список часто задаваемых вопросов.",
            "~n",
            "~adЧасто задаваемые вопросы.docx"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 127: {
        "id": "127",
        "type": "",
        "text": [
            "Можете повторить вопрос, или посмотреть наш список часто задаваемых вопросов.",
            "~n",
            "~adЧасто задаваемые вопросы.docx"
        ],
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }

}

TRANSITION_MAP = {
    1: {
        1: 2
    }, 2: {
        1: 3,
        2: 30
    }, 3: {
        1: 8, #5
        2: 4
    }, 4: {
        1: 5,
        2: 6
    }, 5: {
        1: 26,
        2: 26,
        3: 26
    }, 6: {
        1: 26,
        2: 26,
        3: 7,
        4: 26
    }, 7: { ##4
        1: 11,
        2: 16,
        3: 21,
        4: 26,
        5: 26,
        6: 26
    }, 8: { ##5
        1: 1,
        2: 101
    }, 11: {
        1: 12
    }, 12: {
        1: 4,
        2: 1
    }, 16: {
        1: 17
    }, 17: {        
        1: 4,
        2: 1
    }, 21: {
        1: 22
    }, 22: {
        1: 4,
        2: 1
    }, 26: {
        1: 4,
        2: 1
    }, 30: {
        1: 31,
        2: 61
    }, 31: {
        1: 32,
        2: 33,
        3: 34
    }, 32: {
        1: 35
    }, 33: {
        1: 35
    }, 3431: {
        1: 31,
        2: 1
    }, 3435: {
        1: 35,
        2: 31,
        3: 1
    }, 35: {
        1: 36,
        2: 36,
        3: 36,
        4: 34
    }, 36: {
        1: 37,
        2: 38
    }, 37: {
        1: 39
    }, 38: {
        1: 36,
        2: 31,
        3: 1
    }, 39: {
        1: 41,
        2: 40
    }, 40: {
        1: 39,
        2: 31,
        3: 1
    }, 41: {
        1: 42,
        2: 44,
        3: 43
    }, 42: {
        1: 44
    }, 43: {
        1: 44
    }, 44: {
        1: 45,
        2: 46
    }, 45: {
        1: 44,
        2: 31,
        3: 1
    }, 46: {
        1: 47,
        2: 48
    }, 47: {
        1: 46,
        2: 31,
        3: 1
    }, 48: {
        1: 61
    }, 61: {
        1: 4,
        2: 62,
        3: 8 #5
    }, 62: {
        1: 4,
        2: 8,
        3: 1
    }, 101: {
        1: 1,
        2: 127
    }, 102: {
        1: 1,
        2: 127
    }, 103: {
        1: 1,
        2: 127
    }, 104: {
        1: 1,
        2: 127
    }, 105: {
        1: 1,
        2: 127
    }, 106: {
        1: 1,
        2: 127
    }, 107: {
        1: 1,
        2: 127
    }, 108: {
        1: 1,
        2: 127
    }, 109: {
        1: 1,
        2: 127
    }, 110: {
        1: 1,
        2: 127
    }, 111: {
        1: 1,
        2: 127
    }, 112: {
        1: 1,
        2: 127
    }, 113: {
        1: 1,
        2: 127
    }, 114: {
        1: 1,
        2: 127
    }, 115: {
        1: 1,
        2: 127
    }, 116: {
        1: 1,
        2: 127
    }, 117: {
        1: 1,
        2: 127
    }, 118: {
        1: 1,
        2: 127
    }, 119: {
        1: 1,
        2: 127
    }, 120: {
        1: 1,
        2: 127
    }, 121: {
        1: 1,
        2: 127
    }, 122: {
        1: 1,
        2: 127
    }, 123: {
        1: 1,
        2: 127
    }, 124: {
        1: 1,
        2: 127
    }, 125: {
        1: 1,
        2: 127
    }, 126: {
        1: 1
    }, 127: {
        1: 1
    }
}
