MESSAGES = {
    1: {
        "id": "1",
        "text": "Привет! \"Я всё сам\", бот для самозанятых! Знаю все о самозанятых и подбираю документы для самостоятельного ведения дела. Ты самозанятый или хочешь стать им? Тогда я тебе помогу!",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Начать"
            }
        ]
    }, 2: {
        "id": "2",
        "text": "Зарегистрированы ли вы в качестве самозанятого?",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 3: {
        "id": "3",
        "text": "Выберете следующее действие:",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Ответы на вопросы о самозанятых"
            }, {
                "name": 2,
                "text": "Проекты документов"
            }
        ]
    }, 4: {
        "id": "4",
        "text": "Подборка проектов договоров для самозанятых",
        "files": "",
        "is_buttons": True,
        "buttons": [
{
                "name": 1,
                "text": "Найм помещений"
            }, {
                "name": 2,
                "text": "Уборка помещений"
            }, {
                "name": 3,
                "text": "Ремонт помещений"
            }, {
                "name": 4,
                "text": "Другое"
            }
        ]
    }, 5: {
        "id": "5",
        "text": "Введите ваш вопрос:",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 11: {
        "id": "11",
        "text": "Сдача в найм жилых помещений",
        "files": "",
        "is_buttons": False,
        "buttons": [

        ]
    }, 12: {
        "id": "12",
        "text": "Договор найма жилого помещения самозанятого",
        "files": "Договор найма жилого помещения самозанятого.docx",
        "is_buttons": False,
        "buttons": [

        ]
    }, 13: {
        "id": "13",
        "text": "Акт приёма-передачи к Договору найма жилого помещения",
        "files": "Акт приёма-передачи к Договору найма жилого помещения.docx",
        "is_buttons": False,
        "buttons": [

        ]
    }, 14: {
        "id": "14",
        "text": "Акт возврата к Договору найма жилого помещения",
        "files": "Акт возврата к Договору найма жилого помещения.docx",
        "is_buttons": True,
        "buttons": [

        ]
    }, 15: {
        "id": "15",
        "text": "Акт сдачи-приемки услуг",
        "files": "Акт сдачи-приемки услуг.docx",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 16: {
        "id": "16",
        "text": "Уборка жилых помещений",
        "files": "",
        "is_buttons": True,
        "buttons": [

        ]
    }, 17: {
        "id": "17",
        "text": "Договор возмездного оказания услуг по уборке (на постоянной основе)",
        "files": "Договор возмездного оказания услуг по уборке_на постоянной основе.docx",
        "is_buttons": True,
        "buttons": [

        ]
    }, 18: {
        "id": "18",
        "text": "Акт сдачи-приемки услуг",
        "files": "Акт сдачи-приемки услуг.docx",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 21: {
        "id": "21",
        "text": "Ремонт жилых помещений",
        "files": "",
        "is_buttons": True,
        "buttons": [

        ]
    }, 22: {
        "id": "22",
        "text": "Договор подряда на выполнение ремонтных работ",
        "files": "Договор подряда на выполнение ремонтных работ.docx",
        "is_buttons": True,
        "buttons": [

        ]
    }, 23: {
        "id": "23",
        "text": "Акт сдачи-приемки услуг",
        "files": "Акт сдачи-приемки услуг.docx",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 26: {
        "id": "26",
        "text": "К сожалению, у нас ещё нет документов для этого вида деятельности. Добавление планируется в ___",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 30: {
        "id": "30",
        "text": "Пройти тест 'Могу ли я стать самозанятым?'",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 31: {
        "id": "31",
        "text": "Сколько вам лет?",
        "files": "",
        "is_buttons": False,
        "buttons": [
            {
                "name": 1,
                "text": "Мне 18 лет и больше"
            }, {
                "name": 2,
                "text": "Мне от 14 до 18 лет"
            }, {
                "name": 3,
                "text": "Мне меньше 14 лет"
            }
        ]
    }, 32: {
        "id": "32",
        "text": "Вы можете осуществлять деятельность в качестве самозанятого",
        "files": "",
        "is_buttons": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 33: {
        "id": "33",
        "text": "Вы можете осуществлять деятельность в качестве самозанятого, если вы — дееспособный гражданин (например, после вступления в брак или эмансипации) или у вас есть письменное согласие родителей на осуществление деятельности",
        "files": "",
        "is_buttons": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 3431: {
        "id": "3431",
        "text": "Вы не можете осуществлять деятельность в качестве самозанятого",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 3435: {
        "id": "3435",
        "text": "Вы не можете осуществлять деятельность в качестве самозанятого",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 35: {
        "id": "35",
        "text": "Гражданином какой страны вы являетесь?",
        "files": "",
        "is_buttons": False,
        "buttons": [
            {
                "name": 1,
                "text": "Гражданин РФ"
            }, {
                "name": 2,
                "text": "Гражданин Армении, Беларуси, Казахстана, Кыргызстана"
            }, {
                "name": 3,
                "text": "Гражданин Украины, ДНР или ЛНР"
            }, {
                "name": 4,
                "text": "Гражданин иной страны/лицо без гражданства"
            }
        ]
    }, 36: {
        "id": "36",
        "text": "На какой территории вы планируете осуществлять деятельность?",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "На территории Российской Федерации"
            }, {
                "name": 2,
                "text": "Заграницей"
            }
        ]
    }, 37: {
        "id": "37",
        "text": "Обратите внимание, что в качестве самозанятого вы можете осуществлять деятельность только в пределах одного субъекта России",
        "files": "",
        "is_buttons": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 38: {
        "id": "38",
        "text": "Вы можете осуществлять деятельность в качестве самозанятого только в пределах России",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 39: {
        "id": "39",
        "text": "Планируете ли вы осуществлять деятельность, приносящую доход?",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 40: {
        "id": "40",
        "text": "Чтобы быть самозанятым, важно получать доход. Если вы не получаете доход от продажи товаров, выполнения работ, оказания услуг или реализации имущественных прав, вы не можете стать самозанятым",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 41: {
        "id": "41",
        "text": "Планируете ли вы быть работником или работодателем по трудовому договору?",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 42: {
        "id": "42",
        "text": "Вы не можете быть самозанятым, если ваши доходы — это доходы от работы по трудовому договору либо доходы от найма работников",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 43: {
        "id": "43",
        "text": "Обратите внимание, что как самозанятый вы не можете оказывать услуги вашим бывшим работодателям (были в трудовых отношениях менее двух лет назад)",
        "files": "",
        "is_buttons": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 44: {
        "id": "44",
        "text": "Планируете ли вы получать доход от деятельности самозанятого более 200 т./руб. в месяц?",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 45: {
        "id": "45",
        "text": "Ваш доход от деятельности самозанятого не может превышать более 2.4 млн. рублей в текущем календарном году",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 46: {
        "id": "46",
        "text": "Планируете ли вы заниматься указанными видами деятельности: " +\
                "реализация подакцизных товаров и товаров, подлежащих обязательной маркировке (например, табачные изделия, обувь и другие); " +\
                "перепродажа товаров и имущественных прав; доставка товаров в интересах других лиц (кроме случаев, когда оплата производится через кассу продавца; " +\
                "предпринимательская деятельность в интересах другого лица; добыча или сбыт полезных ископаемых",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 47: {
        "id": "47",
        "text": "Лица, занимающиеся данным видом деятельности, не вправе переходить на специальный налоговый режим «Налог на профессиональный доход» и считаться самозанятыми",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            },{
                "name": 2,
                "text": "Пройти тест заново"
            }, {
                "name": 3,
                "text": "К началу бота"
            }
        ]
    }, 48: {
        "id": "48",
        "text": "Вы соответствуете всем критериям и вправе осуществлять деятельность в качестве самозанятого",
        "files": "",
        "is_buttons": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 61: {
        "id": "61",
        "text": "Выберете следующее действие:",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К материалам"
            }, {
                "name": 2,
                "text": "К регистрации"
            }, {
                "name": 3,
                "text": "К вопросам"
            }
        ]
    }, 62: {
        "id": "62",
        "text": "Регистрация через ФНС",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "На сайт ФНС"
            }
        ]
    }, 100: {
        "id": "100",
        "text": "Извините, я не понимаю ваш ответ. Можете повторить?",
        "files": "",
        "is_buttons": False,
        "buttons": [

        ]
    }, 101: {
        "id": "101",
        "text": """Найден похожий вопрос:
        Кто вправе стать «самозанятым» и применять налог на профессиональный доход?
        Применять специальный налоговый режим «Налог на профессиональный доход» могут физические лица (граждане России и других государств ЕАЭС), а также индивидуальные предприниматели, не имеющие наемных работников по трудовому договору. Они могут осуществлять реализацию собственных товаров (работ, услуг, имущественных прав), местом ведения деятельности является территория любого из субъектов Российской Федерации.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 102: {
        "id": "102",
        "text": """Найден похожий вопрос:
        Каким образом выдавать платежные документы (чек)? Как рассчитываться с клиентом?\n\n

        Ответ: При расчетах самозанятого налогоплательщика с покупателем (клиентом) с использованием мобильного приложения «Мой налог»/ веб кабинета «Мой налог», необходимо сформировать и выдать чек. Это делается через добавление новой продажи. При этом понадобится указать наименование товара, работы или услуги и ввести ее стоимость.

        Чек необходимо передать клиенту одним из следующих способов:

        · отправить на мобильный телефон или электронную почту;

        · распечатать и передать лично;

        · предоставить для считывания по QR-коду чека с мобильного телефона налогоплательщика налога на профессиональный доход с помощью телефона клиента.

        По общему правилу отражать получаемые доходы необходимо сразу в момент расчета.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 103: {
        "id": "103",
        "text": """Найден похожий вопрос:
        Как платить налог на профессиональный доход?

        Квитанция на уплату налога автоматически формируется налоговым органом и направляется в приложение «Мой налог». Для простоты оплаты квитанция содержит специализированный QR-код.

        Получив квитанцию, Вы можете оплатить налог любым из следующих способов:

        · непосредственно через мобильное приложение «Мой налог»/веб-кабинет «Мой налог» с использованием банковской карты;

        · в мобильном приложении Вашего банка или на сайте любого платежного сервиса по платежным реквизитам из квитанции или отсканировав QR-код из нее;

        · через портал государственных услуг Российской Федерации;

        · лично обратиться с квитанцией в любой банк, банкомат или платежный терминал;

        · передать поручение банку или оператору электронных площадок на уплату налога от Вашего имени в случае, если Вы формируете чеки через приложение соответствующего банка или оператора электронных площадок.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 104: {
        "id": "104",
        "text": """Найден похожий вопрос:
        Какие налоговые ставки предусмотрены по налогу на профессиональный доход?

        Ответ:

        Ставки:

        · 4% используется при расчетах с физическими лицами;

        · 6% используется при расчетах с организациями и индивидуальными предпринимателями.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 105: {
        "id": "105",
        "text": """Найден похожий вопрос:
        Какой срок уплаты налога на профессиональный доход?

        Ответ: Уплата налога на профессиональный доход производится ежемесячно не позднее 25 числа месяца, следующего за истекшим налоговым периодом (месяцем). Если эта дата является праздничным или выходным днем, тогда срок уплаты переносится на первый рабочий день.

        Следует учесть, что первый налоговый период считают со дня регистрации и до конца следующего месяца. Например, при постановке на учет в январе уведомление о начисленном налоге впервые придет до 12 марта. Заплатить указанную в нем сумму нужно до 25 марта.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 106: {
        "id": "106",
        "text": """Найден похожий вопрос:
        Кто не вправе применять специальный налоговый режим «Налог на профессиональный доход»?

        Ответ: Не вправе применять специальный налоговый режим (часть 2 статьи 4 422-ФЗ):

        · Лица, осуществляющие реализацию подакцизных товаров и товаров, подлежащих обязательной маркировке средствами идентификации в соответствии с законодательством Российской Федерации;

        · Лица, осуществляющие перепродажу товаров, имущественных прав, за исключением продажи имущества, использовавшегося ими для личных, домашних и (или) иных подобных нужд;

        · Лица, занимающиеся добычей и (или) реализацией полезных ископаемых;

        · Лица, имеющие работников, с которыми они состоят в трудовых отношениях;

        · Лица, ведущие предпринимательскую деятельность в интересах другого лица на основе договоров поручения, договоров комиссии либо агентских договоров, за исключением случаев ведения такой деятельности при условии применения налогоплательщиком-продавцом контрольно-кассовой техники при расчетах с заказчиками за указанные услуги в соответствии с действующим законодательством РФ о применении контрольно-кассовой техники;

        · Лица, оказывающие услуги по доставке товаров с приемом (передачей) платежей за указанные товары в интересах других лиц, за исключением оказания таких услуг при условии применения налогоплательщиком зарегистрированной продавцом товаров контрольно-кассовой техники при расчетах с покупателями (заказчиками) за указанные товары в соответствии с действующим законодательством о применении контрольно-кассовой техники;

        · Лица, применяющие иные специальные налоговые режимы или ведущие предпринимательскую деятельность, доходы от которой облагаются налогом на доходы физических лиц, за исключением случаев, предусмотренных частью 4 статьи 15 Федерального закона от 27.11.2018 №422-ФЗ;

        · Налогоплательщики, у которых доходы, учитываемые при определении налоговой базы, превысили в текущем календарном году 2,4 миллиона рублей.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 107: {
        "id": "107",
        "text": """Найден похожий вопрос:
        Каким образом самозанятый налогоплательщик будет проинформирован о необходимости уплаты налога?

        Ответ:

        1. В период с 9-го по 12-е число месяца, следующего за истекшим налоговым периодом, налоговым органом автоматически формируется квитанция на уплату налога и направляется Вам в мобильное приложение «Мой налог» и в веб-кабинет «Мой налог». Если сумма исчисленного налога не превышает 100 рублей, этот налог будет включен в следующий налоговый период, пока размер налога не составит более 100 рублей.

        2. Налогоплательщик вправе уполномочить на уплату налога операторов электронных площадок и (или) кредитные организации, которые осуществляют информационный обмен с налоговыми органами. В этом случае налоговый орган будет дополнительно направлять уведомление об уплате налога уполномоченному лицу. """,
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 108: {
        "id": "108",
        "text": """Найден похожий вопрос:
        Кто такие «самозанятые» налогоплательщики налога на профессиональный доход?

        Ответ:

        Федеральным законом от 27.11.2018 № 422-ФЗ данный термин не определен. В широком смысле – это форма занятости, при которой гражданин получает доход от его профессиональной деятельности, например, оказание услуг или работ, реализация произведенных им товаров, при осуществлении которых он не имеет работодателя и наемных работников.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 109: {
        "id": "109",
        "text": """Найден похожий вопрос:
        Каким образом плательщик налога на профессиональный доход может получить справку о постановке на учет?

        В мобильном приложении «Мой налог» и веб-кабинете, расположенном на сайте ФНС России https://npd.nalog.ru «самозанятый» налогоплательщик может самостоятельно сформировать справку о постановке на учет (снятии с учета) в налоговом органе физического лица в качестве налогоплательщика. Указанная справка подписывается электронной подписью налогового органа, сформированной в соответствии с Федеральным законом от 6 апреля 2011 года № 63-ФЗ «Об электронной подписи». """,
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 110: {
        "id": "110",
        "text": """Найден похожий вопрос:
        Каков порядок снятия с налогового учета плательщика НПД в добровольном порядке?

        Ответ:

        Снятие с налогового учета плательщика НПД в добровольном порядке осуществляется при представлении в налоговый орган через мобильное приложение «Мой налог»/веб-кабинет «Мой налог» заявления о снятии с учета в случае отказа от применения специального налогового режима.

        Процедура снятия с учета проходит без посещения налогового органа через мобильное приложение «Мой налог»/веб-кабинет. Для этого в мобильном приложении «Мой налог»

        необходимо в разделе «Прочее»-«Профиль» внизу нажать кнопку «Сняться с учета НПД», выбрать причину снятия с данного режима налогообложения и подтвердить свое решение.

        Датой снятия с учета в качестве плательщика НПД является дата направления в налоговый орган заявления о снятии с учета.

        При постановке на учет в качестве плательщика НПД через уполномоченную кредитную организацию о решении сняться с учета в качестве плательщика НПД необходимо уведомить уполномоченную кредитную организацию.

        Налогоплательщик после снятия с учета в налоговом органе в качестве налогоплательщика вправе повторно встать на учет в качестве плательщика НПД при отсутствии у него недоимки по налогу, задолженности по пеням и штрафам по налогу.

        После снятия с учета (утраты права) предоставляется ограниченный доступ в мобильное приложение «Мой налог»/веб-кабинет «Мой налог», в котором будет сохранена функция уплаты налога.""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 111: {
        "id": "111",
        "text": """Найден похожий вопрос:
        Будут ли брать налог с самозанятого в момент перевода денежных средств, полученных от покупателя (клиента), за товар (работу, услугу)?

        Ответ:

        Нет, сумма налога, рассчитывается налоговым органом, исходя из суммы дохода налогоплательщика налога на профессиональный доход, который такой налогоплательщик обязан отразить в мобильном приложении «Мой налог» \\ вэб-кабинете «Мой налог».""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 112: {
        "id": "112",
        "text": """Найден похожий вопрос:
        В какие сроки самозанятому необходимо производить платежи по страховым взносам?

        Ответ: Рассчитанные суммы добровольных платежей надо уплатить не позднее 31 декабря текущего календарного года.

        ИСТОЧНИК:

        Пункт 5 статьи 29 Федерального закона от 15.12.2001 № 167-ФЗ «Об обязательном пенсионном страховании в Российской Федерации» """,
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 113: {
        "id": "113",
        "text": """Найден похожий вопрос:
        В какой срок налоговый орган производит перерасчет налога после аннулирования чека и направляет новую квитанцию на уплату налога?

        Ответ:

        Налоговый орган производит расчёт налога ежемесячно не позднее 12-го числа месяца, следующего за истекшим налоговым периодом. Каждый расчет налога учитывает аннулированные чеки. При этом отдельное уведомление не формируется.

        Налоговый орган уведомит самозанятого налогоплательщика через мобильное приложение «Мой налог» и веб-кабинет «Мой налог» о сумме налога, подлежащей уплате, с указанием реквизитов. Соответственно, в указанной сумме уже будут учтены Ваши корректировки дохода.

        ИСТОЧНИК:

        Статья 11 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход».""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 114: {
        "id": "114",
        "text": """Найден похожий вопрос:
        В какой срок необходимо сформировать чек на полученную сумму профессионального дохода? Какой период можно будет выбрать в приложении «Мой налог», если сразу не сформировал чек? Если чек был сформирован не в момент расчета с покупателем, предусмотрен ли какой-либо штраф?

        Ответ:

        Чек должен быть сформирован самозанятым и передан покупателю (заказчику) в момент расчета наличными денежными средствами и (или) с использованием электронных средств платежа. При иных формах денежных расчетов в безналичном порядке чек должен быть сформирован и передан покупателю (заказчику) не позднее 9-го числа месяца, следующего за налоговым периодом, в котором произведены расчеты*. В мобильном приложении «Мой налог» самозанятый при формировании чека может указать дату осуществления расчета, даже если такая дата уже прошла, данный расчет будет включен в сумму налога в следующем налоговом периоде. Нарушение налогоплательщиком порядка и (или) сроков передачи в налоговый орган сведений о произведенном расчете, связанном с получением дохода от реализации товаров (работ, услуг, имущественных прав), влечет взыскание штрафа в размере 20 процентов от суммы такого расчета. Те же деяния, совершенные повторно в течение шести месяцев, влекут взыскание штрафа в размере суммы такого расчета**

        ИСТОЧНИК:

        *Часть 3 статьи 14 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»;

        **Статья 129.13 Налогового Кодекса Российской Федерации""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 115: {
        "id": "115",
        "text": """Найден похожий вопрос:
        В какой срок отображается информация об уплате налога в мобильном приложении «Мой налог»?

        Ответ:

        Информация об уплате налога отображается как правило в течение 10 рабочих дней при оплате банковской картой и в течение 20 календарных дней при оплате по квитанции через кредитную организацию""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 116: {
        "id": "116",
        "text": """Найден похожий вопрос:
        В какой срок самозанятый налогоплательщик должен передать чек заказчику?

        Ответ:

        В общем случае отражать получаемые доходы и передавать чеки необходимо сразу в момент расчета. При других формах расчета чек формируется и передается не позднее 9-го числа месяца, следующего за тем, в котором произведена оплата. Если «самозанятый» налогоплательщик работает через посредника по договору комиссии, поручения или агентскому договору, и кто-то продает товары услуги в его интересах, в этом случае чек формирует не налогоплательщик налога на профессиональный доход, а посредник. При условии, что по закону у посредника есть обязанность применять контрольно-кассовую технику.

        ИСТОЧНИК:

        Часть 3 статьи 14 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 117: {
        "id": "117",
        "text": """Найден похожий вопрос:
        В каком порядке осуществляется зачет и возврат сумм излишне уплаченного налога на профессиональный доход?

        Ответ:

        Сумма излишне уплаченного налога подлежит зачету в счет предстоящих платежей налогоплательщика, погашения недоимки, задолженности по пеням и штрафам за налоговые правонарушения только по этому налогу. Возврат сумм излишне уплаченного налога на профессиональный доход осуществляется в порядке, предусмотренном статьей 78 Налогового кодекса Российской Федерации.

        Заявление на возврат/зачет излишне уплаченного налога может быть подано в ИФНС следующим способом:

        - лично налогоплательщиком;

        - его представителем по нотариальной доверенности;

        - почтой (с уведомлением о вручении, описью вложения); - в электронной форме с использованием интернет-сервиса «Личный кабинет налогоплательщика для физических лиц», подписанное усиленной квалифицированной или неквалифицированной электронной подписью налогоплательщика.

        ИСТОЧНИК:

        Часть 6 статьи 8 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход» """,
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 118: {
        "id": "118",
        "text": """Найден похожий вопрос:
        В каком порядке представляется налоговый вычет (бонус) для самозанятых налогоплательщиков?

        Ответ:

        Бонус в размере 10 000 рублей предоставляется государством единожды и расходуется постепенно. С помощью бонуса налоговая ставка по доходу, полученному самозанятым налогоплательщиком от физических лиц, будет автоматически уменьшена с 4% до 3%, по доходу, полученному от юридических лиц – с 6% до 4%. Например доход за месяц составил 10000 рублей, и весь доход самозанятый получили от физических лиц, следовательно, будет начислен налог в размере 400 рублей. Но с помощью бонуса нужно будет заплатить только 300 рублей, так как 100 рублей автоматически будет списано из бонуса. При этом остаток бонуса будет уменьшен с 10000 рублей до 9900 рублей. После того как бонус будет полностью потрачен, налоговые ставки будут 4% и 6% соответственно. Потратить бонус можно только для уплаты налога. Повторно бонус не предоставляется. Остаток бонуса уменьшается автоматически, и самозанятый налогоплательщик всегда может его увидеть на главной странице или в настройках профиля в приложении «Мой налог».

        ИСТОЧНИК:

        Части 2, 3, 4 статьи 12 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 119: {
        "id": "119",
        "text": """Найден похожий вопрос:
        В каком размере плательщикам НПД необходимо уплачивать страховые взносы? Какой максимальный размер добровольных страховых взносов?

        Ответ:

        Физические лица, применяющие специальный налоговый режим «Налог на профессиональный доход», постоянно или временно проживающие на территории Российской Федерации, вправе добровольно вступить в правоотношения по обязательному пенсионному страхованию.

        Плательщик самостоятельно определяет размер страховых взносов для уплаты, но в пределах максимального размера, определенного законодательством. Максимальный размер страховых взносов составляет:

        - 270 167,04 рублей за период с 01.01.2021 по 31.12.2021;

        - 293 356,80 рублей за период с 01.01.2022 по 31.12.2022.

        ИСТОЧНИК:

        Пункт 6 статьи 29 Федерального закона от 15.12.2001 № 167-ФЗ «Об обязательном пенсионном страховании в Российской Федерации»;

        Подпункт 1 пункта 2 статьи 425 Налогового кодекса Российской Федерации""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 120: {
        "id": "120",
        "text": """Найден похожий вопрос:
        В приложении «Мой налог» наименование услуг, работы или товара при вводе оплаты необходимо заводить каждый раз вручную?

        Ответ:

        Нет, сведения об оказанной услуге, выполненной работе или реализованном товаре будут сохранены в истории операций, в связи с чем, при необходимости. «самозанятый» налогоплательщик сможет повторить платеж, не изменяя наименование услуги или товара, изменив только сумму. Для создания копии чека необходимо открыть чек, копию которого необходимо сделать, и нажать кнопку «Повторить».""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 121: {
        "id": "121",
        "text": """Найден похожий вопрос:
        Вправе ли плательщик НПД сдавать в аренду транспортное средство и другие виды движимого имущества?

        Ответ:

        Федеральный закон № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход» не содержит ограничений относительно сдачи в аренду движимого имущества, включая транспортные средства и специальную технику.

        ИСТОЧНИК:

        Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход» """,
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 122: {
        "id": "122",
        "text": """Найден похожий вопрос:
        Если инвалид 2-ой группы оформится в качестве самозанятого налогоплательщика, сохранится ли его статус инвалида? И вытекающие из неё возможности получать лекарства, проходить реабилитацию и т.п.?

        Ответ:

        Налогоплательщиками налога на профессиональный доход могут быть физические лица и индивидуальные предприниматели, не имеющие наемных работников по трудовому договору, осуществляющие реализацию товаров (работ, услуг, имущественных прав) на территории Российской Федерации. Физические лица, применяющие специальный налоговый режим, освобождаются от налогообложения налогом на доходы физических лиц в отношении доходов, являющихся объектом налогообложения налогом на профессиональный доход. Данный налоговый режим не может повлиять на статус инвалида и на компенсации, связанные с этим статусом.

        ИСТОЧНИК:

        Федеральный закон от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 123: {
        "id": "123",
        "text": """Найден похожий вопрос:
        Если ИП встает на учет как самозанятый налогоплательщик, как рассчитываются и уплачиваются страховые взносы?

        Ответ:

        Индивидуальные предприниматели, указанные в подпункте 2 пункта 1 статьи 419 Налогового кодекса Российской Федерации, не признаются плательщиками страховых взносов за период применения специального налогового режима «Налог на профессиональный доход».

        ИСТОЧНИК:

        Часть 11 статьи 2 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 124: {
        "id": "124",
        "text": """Найден похожий вопрос:
        Если пенсионер зарегистрируется в качестве налогоплательщика налога на профессиональный доход, то будет ли он получать компенсации?

        Ответ:

        Доходы, получаемые налогоплательщиками, зарегистрированными в качестве налогоплательщиков налога на профессиональных доход, не подлежат обязательному пенсионному страхованию, в связи с чем трудовой стаж у таких налогоплательщиков в период уплаты налога на профессиональный доход, не идет. Также и пенсионер, зарегистрированный в качестве налогоплательщика налога на профессиональный доход, считается трудоустроенным только в период, когда их доходы подлежат обязательному пенсионному страхованию в соответствии с Федеральным законом от 15 декабря 2001 года № 167-ФЗ «Об обязательном пенсионном страховании в Российской Федерации». В связи с этим, статус налогоплательщика налога на профессиональный доход не влияет на получение льгот и компенсаций.

        ИСТОЧНИК:

        Часть 2 статьи 4, часть 2 статьи 6 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 125: {
        "id": "125",
        "text": """Найден похожий вопрос:
        Если самозанятый налогоплательщик вернул деньги и аннулировал чек, какие действия должен произвести заказчик?

        Ответ:

        При возврате суммы оплаты заказчику можно аннулировать чек. При аннулировании чека из-за неточных данных сумма дохода налогоплательщика налога на профессиональный доход тоже корректируется. При этом налогоплательщику налога на профессиональный доход может потребоваться указать причину аннулирования. Если чек аннулирован, заказчик также вносит изменения в суммы расходов, учитываемых при расчете налоговой базы. Порядок корректировки зависит от применяемого заказчиком режима налогообложения.

        ИСТОЧНИК:

        Части 3, 4 ст. 8 Федерального закона от 27.11.2018 № 422-ФЗ «О проведении эксперимента по установлению специального налогового режима «Налог на профессиональный доход»""",
        "files": "",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 126: {
        "id": "126",
        "text": """Извините, я не понимаю ваш вопрос. Можете повторить вопрос, или посмотреть наш список часто задаваемых вопросов.""",
        "files": "Часто задаваемые вопросы.docx",
        "is_buttons": True,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }

}

TRANSITION_MAP = {
    1: {
        1: 2
    }, 2: {
        1: 3,
        2: 30
    }, 3: {
        1: 5,
        2: 4
    }, 4: {
        1: 11,
        2: 16,
        3: 21,
        4: 26
    }, 5: {
        1: 1,
        2: 101
    }, 11: {
        1: 12
    }, 12: {
        1: 13
    }, 13: {
        1: 14
    }, 14: {
        1: 15
    }, 15: {
        1: 4,
        2: 1
    }, 16: {
        1: 17
    }, 17: {
        1: 18
    }, 18: {
        1: 4,
        2: 1
    }, 21: {
        1: 22
    }, 22: {
        1: 23
    }, 23: {
        1: 4,
        2: 1
    }, 26: {
        1: 4,
        2: 1
    }, 30: {
        1: 31,
        2: 61
    }, 31: {
        1: 32,
        2: 33,
        3: 34
    }, 32: {
        1: 35
    }, 33: {
        1: 35
    }, 3431: {
        1: 31,
        2: 1
    }, 3435: {
        1: 35,
        2: 31,
        3: 1
    }, 35: {
        1: 36,
        2: 36,
        3: 36,
        4: 34
    }, 36: {
        1: 37,
        2: 38
    }, 37: {
        1: 39
    }, 38: {
        1: 36,
        2: 31,
        3: 1
    }, 39: {
        1: 41,
        2: 40
    }, 40: {
        1: 39,
        2: 31,
        3: 1
    }, 41: {
        1: 42,
        2: 43
    }, 42: {
        1: 41,
        2: 31,
        3: 1
    }, 43: {
        1: 44
    }, 44: {
        1: 45,
        2: 46
    }, 45: {
        1: 44,
        2: 31,
        3: 1
    }, 46: {
        1: 47,
        2: 48
    }, 47: {
        1: 46,
        2: 31,
        3: 1
    }, 48: {
        1: 61
    }, 61: {
        1: 4,
        2: 62,
        3: 5
    }, 101: {
        1: 1,
        2: 5
    }, 102: {
        1: 1,
        2: 5
    }, 103: {
        1: 1,
        2: 5
    }, 104: {
        1: 1,
        2: 5
    }, 105: {
        1: 1,
        2: 5
    }, 106: {
        1: 1,
        2: 5
    }, 107: {
        1: 1,
        2: 5
    }, 108: {
        1: 1,
        2: 5
    }, 109: {
        1: 1,
        2: 5
    }, 110: {
        1: 1,
        2: 5
    }, 111: {
        1: 1,
        2: 5
    }, 112: {
        1: 1,
        2: 5
    }, 113: {
        1: 1,
        2: 5
    }, 114: {
        1: 1,
        2: 5
    }, 115: {
        1: 1,
        2: 5
    }, 116: {
        1: 1,
        2: 5
    }, 117: {
        1: 1,
        2: 5
    }, 118: {
        1: 1,
        2: 5
    }, 119: {
        1: 1,
        2: 5
    }, 120: {
        1: 1,
        2: 5
    }, 121: {
        1: 1,
        2: 5
    }, 122: {
        1: 1,
        2: 5
    }, 123: {
        1: 1,
        2: 5
    }, 124: {
        1: 1,
        2: 5
    }, 125: {
        1: 1,
        2: 5
    }, 126: {
        1: 1
    }
}
