MESSAGES = {
    1: {
        "text": "Привет! Я всё сам, бот для самозанятых! Знаю все о самозанятых и подбираю документы для самостоятельного ведения дела. Ты самозанятый или хочешь стать им? Тогда я тебе помогу!",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Начать"
            }
        ]
    }, 2: {
        "text": "Зарегистрированы ли вы в качестве самозанятого?",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 3: {
        "text": "Хотите посмотреть ответы на вопросы о самозанятости или проекты документов",
        "files": None,
        "is_buttons": True,
        "is_field": True,
        "buttons": [
            {
                "name": 1,
                "text": "Ответы на вопросы о самозанятых"
            }, {
                "name": 2,
                "text": "Проекты документов"
            }
        ]
    }, 4: {
        "text": "Подборка проектов договоров для самозанятых",
        "files": None,
        "is_buttons": True,
        "is_field": True,
        "buttons": [
{
                "name": 1,
                "text": "Вариант 1"
            }, {
                "name": 2,
                "text": "Вариант 2"
            }, {
                "name": 3,
                "text": "Вариант 3"
            }, {
                "name": 4,
                "text": "Другое"
            }
        ]
    }, 5: {
        "text": "Справочный материал",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "К началу бота"
            }
        ]
    }, 11: {
        "text": "Вариант 1 + кнопки с подборкой вопросов",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 16: {
        "text": "Вариант 2 + кнопки с подборкой вопросов",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 21: {
        "text": "Вариант 3 + кнопки с подборкой вопросов",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 26: {
        "text": "К сожалению, у нас ещё нет документов для этого вида деятельности. Добавление планируется в ___",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Назад"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 30: {
        "text": "Пройти тест 'Могу ли я стать самозанятым?'",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 31: {
        "text": "Сколько вам лет?",
        "files": None,
        "is_buttons": False,
        "is_field": True,
        "buttons": [
            {
                "name": 1,
                "text": "Мне 18 лет и больше"
            }, {
                "name": 2,
                "text": "Мне от 14 до 18 лет"
            }, {
                "name": 3,
                "text": "Мне меньше 14 лет"
            }
        ]
    }, 32: {
        "text": "Вы можете осуществлять деятельность в качестве самозанятого",
        "files": None,
        "is_buttons": False,
        "is_field": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 33: {
        "text": "Вы можете осуществлять деятельность в качестве самозанятого, если вы — дееспособный гражданин (например, после вступления в брак или эмансипации) или у вас есть письменное согласие родителей на осуществление деятельности",
        "files": None,
        "is_buttons": False,
        "is_field": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 34: {
        "text": "Вы не можете осуществлять деятельность в качестве самозанятого",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново "
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 35: {
        "text": "Гражданином какой страны вы являетесь?",
        "files": None,
        "is_buttons": False,
        "is_field": True,
        "buttons": [
            {
                "name": 1,
                "text": "Гражданин РФ"
            }, {
                "name": 2,
                "text": "Гражданин Армении, Беларуси, Казахстана, Кыргызстана"
            }, {
                "name": 3,
                "text": "Гражданин Украины, ДНР или ЛНР"
            }, {
                "name": 4,
                "text": "Гражданин иной страны/лицо без гражданства"
            }
        ]
    }, 36: {
        "text": "На какой территории вы планируете осуществлять деятельность?",
        "files": None,
        "is_buttons": True,
        "is_field": True,
        "buttons": [
            {
                "name": 1,
                "text": "На территории Российской Федерации"
            }, {
                "name": 2,
                "text": "Заграницей"
            }
        ]
    }, 37: {
        "text": "Обратите внимание, что в качестве самозанятого вы можете осуществлять деятельность только в пределах одного субъекта России",
        "files": None,
        "is_buttons": False,
        "is_field": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 38: {
        "text": "Вы можете осуществлять деятельность в качестве самозанятого только в пределах России",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново "
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 39: {
        "text": "Планируете ли вы осуществлять деятельность, приносящую доход?",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 40: {
        "text": "Чтобы быть самозанятым, важно получать доход. Если вы не получаете доход от продажи товаров, выполнения работ, оказания услуг или реализации имущественных прав, вы не можете стать самозанятым",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново "
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 41: {
        "text": "Планируете ли вы быть работником или работодателем по трудовому договору?",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 42: {
        "text": "Вы не можете быть самозанятым, если ваши доходы — это доходы от работы по трудовому договору либо доходы от найма работников",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново "
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 43: {
        "text": "Обратите внимание, что как самозанятый вы не можете оказывать услуги вашим бывшим работодателям (были в трудовых отношениях менее двух лет назад)",
        "files": None,
        "is_buttons": False,
        "is_field": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 44: {
        "text": "Планируете ли вы получать доход более 200 т./руб. в месяц?",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Да"
            }, {
                "name": 2,
                "text": "Нет"
            }
        ]
    }, 45: {
        "text": "Ваш доход от деятельности самозанятого не может превышать более 2.4 млн. рублей в текущем календарном году",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново "
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 46: {
        "text": "Планируете ли вы заниматься указанными видами деятельности: " +\
                "реализация подакцизных товаров и товаров, подлежащих обязательной маркировке (например, табачные изделия, обувь и другие); " +\
                "перепродажа товаров и имущественных прав; доставка товаров в интересах других лиц (кроме случаев, когда оплата производится через кассу продавца; " +\
                "предпринимательская деятельность в интересах другого лица; добыча или сбыт полезных ископаемых",
        "files": None,
        "is_buttons": False,
        "is_field": True,
        "buttons": [
            {
                "name": 1,
                "text": "Реализация подакцизных товаров и товаров, подлежащих обязательной маркировке (например, табачные изделия, обувь и другие)"
            }, {
                "name": 2,
                "text": "Перепродажа товаров и имущественных прав"
            }, {
                "name": 3,
                "text": "Доставка товаров в интересах других лиц (кроме случаев, когда оплата производится через кассу продавца)"
            }, {
                "name": 4,
                "text": "Предпринимательская деятельность в интересах другого лица"
            }, {
                "name": 5,
                "text": "Добыча или сбыт полезных ископаемых"
            }, {
                "name": 6,
                "text": "Указанными видами деятельности не планирую заниматься"
            }
        ]
    }, 47: {
        "text": "Лица, занимающиеся данным видом деятельности, не вправе переходить на специальный налоговый режим «Налог на профессиональный доход» и считаться самозанятыми",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "Пройти тест заново"
            }, {
                "name": 2,
                "text": "К началу бота"
            }
        ]
    }, 48: {
        "text": "Вы соответствуете всем критериям и вправе осуществлять деятельность в качестве самозанятого",
        "files": None,
        "is_buttons": False,
        "is_field": False,
        "buttons": [
            # {
            #     "name": 1,
            #     "text": "Дальше"
            # }
        ]
    }, 61: {
        "text": "Перейти к регистрации, посмотреть подборку материалов для самозанятых или ответы на вопросы о самозанятости?",
        "files": None,
        "is_buttons": True,
        "is_field": True,
        "buttons": [
            {
                "name": 1,
                "text": "К матриалам"
            }, {
                "name": 2,
                "text": "К регистрации"
            }, {
                "name": 3,
                "text": "К вопросам"
            }
        ]
    }, 62: {
        "text": "Регистрация через ФНС",
        "files": None,
        "is_buttons": True,
        "is_field": False,
        "buttons": [
            {
                "name": 1,
                "text": "На сайт ФНС"
            }
        ]
    }, 100: {
        "text": "Извините, я не понимаю ваш ответ. Можете повторить?",
        "files": None,
        "is_buttons": False,
        "is_field": True,
        "buttons": [

        ]
    }
}

TRANSITION_MAP = {
    1: {
        1: 2
    }, 2: {
        1: 3,
        2: 30
    }, 3: {
        1: 5,
        2: 4
    }, 4: {
        1: 11,
        2: 16,
        3: 21,
        4: 26
    }, 5: {
        1: 1
    }, 11: {
        1: 4,
        2: 1
    }, 16: {
        1: 4,
        2: 1
    }, 21: {
        1: 4,
        2: 1
    }, 26: {
        1: 4,
        2: 1
    }, 30: {
        1: 31,
        2: 61
    }, 31: {
        1: 32,
        2: 33,
        3: 34
    }, 32: {
        1: 35
    }, 33: {
        1: 35
    }, 34: {
        1: 31,
        2: 1
    }, 35: {
        1: 36,
        2: 36,
        3: 36,
        4: 34
    }, 36: {
        1: 37,
        2: 38
    }, 37: {
        1: 39
    }, 38: {
        1: 31,
        2: 1
    }, 39: {
        1: 41,
        2: 40
    }, 40: {
        1: 31,
        2: 1
    }, 41: {
        1: 42,
        2: 43
    }, 42: {
        1: 31,
        2: 1
    }, 43: {
        1: 44
    }, 44: {
        1: 45,
        2: 46
    }, 45: {
        1: 31,
        2: 1
    }, 46: {
        1: 47,
        2: 47,
        3: 47,
        4: 47,
        5: 47,
        6: 48
    }, 47: {
        1: 31,
        2: 1
    }, 48: {
        1: 61
    }, 61: {
        1: 4,
        2: 62,
        3: 5
    }
}